[Killed] BlockStatement
src/operacoes.js:4:21
 // src/operacoes.js
 
 // === Bloco 1: Operações Básicas (1-10) ===
-function soma(a, b) {
-  return a + b;
-}
+function soma(a, b) {}
 function subtracao(a, b) {
   return a - b;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 1. deve somar dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:5:10
 
 // === Bloco 1: Operações Básicas (1-10) ===
 function soma(a, b) {
-  return a + b;
+  return a - b;
 }
 function subtracao(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 1. deve somar dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1

[Killed] BlockStatement
src/operacoes.js:7:26
 function soma(a, b) {
   return a + b;
 }
-function subtracao(a, b) {
-  return a - b;
-}
+function subtracao(a, b) {}
 function multiplicacao(a, b) {
   return a * b;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 2. deve subtrair dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:8:10
   return a + b;
 }
 function subtracao(a, b) {
-  return a - b;
+  return a + b;
 }
 function multiplicacao(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 2. deve subtrair dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 7

[Killed] BlockStatement
src/operacoes.js:10:30
 function subtracao(a, b) {
   return a - b;
 }
-function multiplicacao(a, b) {
-  return a * b;
-}
+function multiplicacao(a, b) {}
 function divisao(a, b) {
   if (b === 0) throw new Error("Divisão por zero não é permitida.");
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 3. deve multiplicar dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:11:10
   return a - b;
 }
 function multiplicacao(a, b) {
-  return a * b;
+  return a / b;
 }
 function divisao(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 3. deve multiplicar dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0.75

[Killed] BlockStatement
src/operacoes.js:13:24
 function multiplicacao(a, b) {
   return a * b;
 }
-function divisao(a, b) {
-  if (b === 0) throw new Error("Divisão por zero não é permitida.");
-  return a / b;
-}
+function divisao(a, b) {}
 function potencia(base, expoente) {
   return Math.pow(base, expoente);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:14:7
   return a * b;
 }
 function divisao(a, b) {
-  if (b === 0) throw new Error("Divisão por zero não é permitida.");
+  if (true) throw new Error("Divisão por zero não é permitida.");
   return a / b;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: Divisão por zero não é permitida.

[Killed] EqualityOperator
src/operacoes.js:14:7
   return a * b;
 }
 function divisao(a, b) {
-  if (b === 0) throw new Error("Divisão por zero não é permitida.");
+  if (b !== 0) throw new Error("Divisão por zero não é permitida.");
   return a / b;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: Divisão por zero não é permitida.

[Killed] ArithmeticOperator
src/operacoes.js:15:10
 }
 function divisao(a, b) {
   if (b === 0) throw new Error("Divisão por zero não é permitida.");
-  return a / b;
+  return a * b;
 }
 function potencia(base, expoente) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 20

[Killed] BlockStatement
src/operacoes.js:17:35
   if (b === 0) throw new Error("Divisão por zero não é permitida.");
   return a / b;
 }
-function potencia(base, expoente) {
-  return Math.pow(base, expoente);
-}
+function potencia(base, expoente) {}
 function raizQuadrada(n) {
   if (n < 0)
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 5. deve calcular a potência com expoente positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined

[Killed] BlockStatement
src/operacoes.js:20:26
 function potencia(base, expoente) {
   return Math.pow(base, expoente);
 }
-function raizQuadrada(n) {
-  if (n < 0)
-    throw new Error(
-      "Não é possível calcular a raiz quadrada de um número negativo."
-    );
-  return Math.sqrt(n);
-}
+function raizQuadrada(n) {}
 function restoDivisao(dividendo, divisor) {
   return dividendo % divisor;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:21:7
   return Math.pow(base, expoente);
 }
 function raizQuadrada(n) {
-  if (n < 0)
+  if (false)
     throw new Error(
       "Não é possível calcular a raiz quadrada de um número negativo."
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 54. raizQuadrada - deve lançar erro para números negativos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Não é possível calcular a raiz quadrada de um número negativo."

Received function did not throw

[Killed] EqualityOperator
src/operacoes.js:21:7
   return Math.pow(base, expoente);
 }
 function raizQuadrada(n) {
-  if (n < 0)
+  if (n >= 0)
     throw new Error(
       "Não é possível calcular a raiz quadrada de um número negativo."
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: Não é possível calcular a raiz quadrada de um número negativo.

[Killed] BlockStatement
src/operacoes.js:27:43
     );
   return Math.sqrt(n);
 }
-function restoDivisao(dividendo, divisor) {
-  return dividendo % divisor;
-}
+function restoDivisao(dividendo, divisor) {}
 function fatorial(n) {
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 7. deve retornar o resto da divisão
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:28:10
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) {
-  return dividendo % divisor;
+  return dividendo * divisor;
 }
 function fatorial(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 7. deve retornar o resto da divisão
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 30

[Killed] BlockStatement
src/operacoes.js:30:22
 function restoDivisao(dividendo, divisor) {
   return dividendo % divisor;
 }
-function fatorial(n) {
-  if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
-  if (n === 0 || n === 1) return 1;
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) {
-    resultado *= i;
-  }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:31:7
   return dividendo % divisor;
 }
 function fatorial(n) {
-  if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
+  if (n <= 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 55. fatorial - deve calcular 0! e 1!
statusReason: Error: Fatorial não é definido para números negativos.

[Killed] EqualityOperator
src/operacoes.js:31:7
   return dividendo % divisor;
 }
 function fatorial(n) {
-  if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
+  if (n >= 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: Fatorial não é definido para números negativos.

[Killed] EqualityOperator
src/operacoes.js:32:7
 }
 function fatorial(n) {
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
-  if (n === 0 || n === 1) return 1;
+  if (n !== 0 || n === 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:32:7
 }
 function fatorial(n) {
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
-  if (n === 0 || n === 1) return 1;
+  if (true) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:34:19
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
-  for (let i = 2; i <= n; i++) {
+  for (let i = 2; i > n; i++) {
     resultado *= i;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:34:19
   if (n < 0) throw new Error("Fatorial não é definido para números negativos.");
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
-  for (let i = 2; i <= n; i++) {
+  for (let i = 2; false; i++) {
     resultado *= i;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] AssignmentOperator
src/operacoes.js:35:5
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) {
-    resultado *= i;
+    resultado /= i;
   }
   return resultado;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.041666666666666664

[Killed] ConditionalExpression
src/operacoes.js:40:7
   return resultado;
 }
 function mediaArray(numeros) {
-  if (numeros.length === 0) return 0;
+  if (false) return 0;
   return somaArray(numeros) / numeros.length;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 57. mediaArray - deve retornar 0 para array vazio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] BlockStatement
src/operacoes.js:48:31
 }
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
-function maximoArray(numeros) {
-  if (numeros.length === 0)
-    throw new Error("Array vazio не possui valor máximo.");
-  return Math.max(...numeros);
-}
+function maximoArray(numeros) {}
 function minimoArray(numeros) {
   if (numeros.length === 0)
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:49:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0)
+  if (false)
     throw new Error("Array vazio не possui valor máximo.");
   return Math.max(...numeros);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 58. maximoArray - deve lançar erro para array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio не possui valor máximo."

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:49:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0)
+  if (true)
     throw new Error("Array vazio не possui valor máximo.");
   return Math.max(...numeros);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: Array vazio не possui valor máximo.

[Killed] StringLiteral
src/operacoes.js:50:21
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
   if (numeros.length === 0)
-    throw new Error("Array vazio не possui valor máximo.");
+    throw new Error("");
   return Math.max(...numeros);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 58. maximoArray - deve lançar erro para array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio не possui valor máximo."
Received message:   ""

      150 |   } else {
      151 |     stryCov_9fa48("48");
    > 152 |     if (stryMutAct_9fa48("51") ? numeros.length !== 0 : stryMutAct_9fa48("50") ? false : stryMutAct_9fa48("49") ? true : (stryCov_9fa48("49", "50", "51"), numeros.length === 0)) throw new Error(stryMutAc

[Killed] MethodExpression
src/operacoes.js:51:10
 function maximoArray(numeros) {
   if (numeros.length === 0)
     throw new Error("Array vazio не possui valor máximo.");
-  return Math.max(...numeros);
+  return Math.min(...numeros);
 }
 function minimoArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 1

[Killed] BlockStatement
src/operacoes.js:53:31
     throw new Error("Array vazio не possui valor máximo.");
   return Math.max(...numeros);
 }
-function minimoArray(numeros) {
-  if (numeros.length === 0)
-    throw new Error("Array vazio не possui valor mínimo.");
-  return Math.min(...numeros);
-}
+function minimoArray(numeros) {}
 function valorAbsoluto(n) {
   return Math.abs(n);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:54:7
   return Math.max(...numeros);
 }
 function minimoArray(numeros) {
-  if (numeros.length === 0)
+  if (numeros.length !== 0)
     throw new Error("Array vazio не possui valor mínimo.");
   return Math.min(...numeros);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: Array vazio не possui valor mínimo.

[Killed] ConditionalExpression
src/operacoes.js:54:7
   return Math.max(...numeros);
 }
 function minimoArray(numeros) {
-  if (numeros.length === 0)
+  if (false)
     throw new Error("Array vazio не possui valor mínimo.");
   return Math.min(...numeros);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 59. minimoArray - deve lançar erro para array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio не possui valor mínimo."

Received function did not throw

[Killed] MethodExpression
src/operacoes.js:56:10
 function minimoArray(numeros) {
   if (numeros.length === 0)
     throw new Error("Array vazio не possui valor mínimo.");
-  return Math.min(...numeros);
+  return Math.max(...numeros);
 }
 function valorAbsoluto(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 100

[Killed] BlockStatement
src/operacoes.js:58:27
     throw new Error("Array vazio не possui valor mínimo.");
   return Math.min(...numeros);
 }
-function valorAbsoluto(n) {
-  return Math.abs(n);
-}
+function valorAbsoluto(n) {}
 function arredondar(n) {
   return Math.round(n);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 13. deve retornar o valor absoluto de um número negativo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/operacoes.js:61:24
 function valorAbsoluto(n) {
   return Math.abs(n);
 }
-function arredondar(n) {
-  return Math.round(n);
-}
+function arredondar(n) {}
 function isPar(n) {
   return n % 2 === 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 14. deve arredondar um número para cima
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
src/operacoes.js:64:19
 function arredondar(n) {
   return Math.round(n);
 }
-function isPar(n) {
-  return n % 2 === 0;
-}
+function isPar(n) {}
 function isImpar(n) {
   return n % 2 !== 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 15. deve retornar true para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:65:10
   return Math.round(n);
 }
 function isPar(n) {
-  return n % 2 === 0;
+  return n % 2 !== 0;
 }
 function isImpar(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 15. deve retornar true para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/operacoes.js:65:10
   return Math.round(n);
 }
 function isPar(n) {
-  return n % 2 === 0;
+  return n * 2 === 0;
 }
 function isImpar(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 15. deve retornar true para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:67:21
 function isPar(n) {
   return n % 2 === 0;
 }
-function isImpar(n) {
-  return n % 2 !== 0;
-}
+function isImpar(n) {}
 function calcularPorcentagem(percentual, valor) {
   return (valor * percentual) / 100;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 16. deve retornar true para um número ímpar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:68:10
   return n % 2 === 0;
 }
 function isImpar(n) {
-  return n % 2 !== 0;
+  return n * 2 !== 0;
 }
 function calcularPorcentagem(percentual, valor) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 83. isImpar - deve retornar false para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:68:10
   return n % 2 === 0;
 }
 function isImpar(n) {
-  return n % 2 !== 0;
+  return n % 2 === 0;
 }
 function calcularPorcentagem(percentual, valor) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 16. deve retornar true para um número ímpar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:70:49
 function isImpar(n) {
   return n % 2 !== 0;
 }
-function calcularPorcentagem(percentual, valor) {
-  return (valor * percentual) / 100;
-}
+function calcularPorcentagem(percentual, valor) {}
 function aumentarPorcentagem(valor, percentual) {
   return valor * (1 + percentual / 100);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 17. deve calcular uma porcentagem simples
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:71:11
   return n % 2 !== 0;
 }
 function calcularPorcentagem(percentual, valor) {
-  return (valor * percentual) / 100;
+  return (valor / percentual) / 100;
 }
 function aumentarPorcentagem(valor, percentual) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 17. deve calcular uma porcentagem simples
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0.04

[Killed] ArithmeticOperator
src/operacoes.js:71:10
   return n % 2 !== 0;
 }
 function calcularPorcentagem(percentual, valor) {
-  return (valor * percentual) / 100;
+  return valor * percentual * 100;
 }
 function aumentarPorcentagem(valor, percentual) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 17. deve calcular uma porcentagem simples
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 1000000

[Killed] BlockStatement
src/operacoes.js:73:49
 function calcularPorcentagem(percentual, valor) {
   return (valor * percentual) / 100;
 }
-function aumentarPorcentagem(valor, percentual) {
-  return valor * (1 + percentual / 100);
-}
+function aumentarPorcentagem(valor, percentual) {}
 function diminuirPorcentagem(valor, percentual) {
   return valor * (1 - percentual / 100);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 18. deve aumentar um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:74:23
   return (valor * percentual) / 100;
 }
 function aumentarPorcentagem(valor, percentual) {
-  return valor * (1 + percentual / 100);
+  return valor * (1 + percentual * 100);
 }
 function diminuirPorcentagem(valor, percentual) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 18. deve aumentar um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 110
Received: 100100

Expected precision:    2
Expected difference: < 0.005
Received difference:   99990

[Killed] ArithmeticOperator
src/operacoes.js:74:10
   return (valor * percentual) / 100;
 }
 function aumentarPorcentagem(valor, percentual) {
-  return valor * (1 + percentual / 100);
+  return valor / (1 + percentual / 100);
 }
 function diminuirPorcentagem(valor, percentual) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 18. deve aumentar um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 110
Received: 90.9090909090909

Expected precision:    2
Expected difference: < 0.005
Received difference:   19.090909090909093

[Killed] BlockStatement
src/operacoes.js:76:49
 function aumentarPorcentagem(valor, percentual) {
   return valor * (1 + percentual / 100);
 }
-function diminuirPorcentagem(valor, percentual) {
-  return valor * (1 - percentual / 100);
-}
+function diminuirPorcentagem(valor, percentual) {}
 function inverterSinal(n) {
   return -n;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 19. deve diminuir um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:77:19
   return valor * (1 + percentual / 100);
 }
 function diminuirPorcentagem(valor, percentual) {
-  return valor * (1 - percentual / 100);
+  return valor * (1 + percentual / 100);
 }
 function inverterSinal(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 19. deve diminuir um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 90
Received: 110.00000000000001

Expected precision:    2
Expected difference: < 0.005
Received difference:   20.000000000000014

[Killed] ArithmeticOperator
src/operacoes.js:77:23
   return valor * (1 + percentual / 100);
 }
 function diminuirPorcentagem(valor, percentual) {
-  return valor * (1 - percentual / 100);
+  return valor * (1 - percentual * 100);
 }
 function inverterSinal(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 19. deve diminuir um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 90
Received: -99900

Expected precision:    2
Expected difference: < 0.005
Received difference:   99990

[Killed] BlockStatement
src/operacoes.js:79:27
 function diminuirPorcentagem(valor, percentual) {
   return valor * (1 - percentual / 100);
 }
-function inverterSinal(n) {
-  return -n;
-}
+function inverterSinal(n) {}
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 20. deve inverter o sinal de um número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: undefined

[Killed] UnaryOperator
src/operacoes.js:80:10
   return valor * (1 - percentual / 100);
 }
 function inverterSinal(n) {
-  return -n;
+  return +n;
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 20. deve inverter o sinal de um número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: 42

[Killed] BlockStatement
src/operacoes.js:84:26
 }
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
-function seno(anguloRad) {
-  return Math.sin(anguloRad);
-}
+function seno(anguloRad) {}
 function cosseno(anguloRad) {
   return Math.cos(anguloRad);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 21. deve calcular o seno de 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/operacoes.js:87:29
 function seno(anguloRad) {
   return Math.sin(anguloRad);
 }
-function cosseno(anguloRad) {
-  return Math.cos(anguloRad);
-}
+function cosseno(anguloRad) {}
 function tangente(anguloRad) {
   return Math.tan(anguloRad);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 22. deve calcular o cosseno de 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/operacoes.js:90:30
 function cosseno(anguloRad) {
   return Math.cos(anguloRad);
 }
-function tangente(anguloRad) {
-  return Math.tan(anguloRad);
-}
+function tangente(anguloRad) {}
 function logaritmoNatural(n) {
   return Math.log(n);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 23. deve calcular a tangente de 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/operacoes.js:93:30
 function tangente(anguloRad) {
   return Math.tan(anguloRad);
 }
-function logaritmoNatural(n) {
-  return Math.log(n);
-}
+function logaritmoNatural(n) {}
 function logaritmoBase10(n) {
   return Math.log10(n);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 24. deve calcular o logaritmo natural de Euler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/operacoes.js:96:29
 function logaritmoNatural(n) {
   return Math.log(n);
 }
-function logaritmoBase10(n) {
-  return Math.log10(n);
-}
+function logaritmoBase10(n) {}
 function arredondarParaBaixo(n) {
   return Math.floor(n);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 25. deve calcular o logaritmo na base 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/operacoes.js:99:33
 function logaritmoBase10(n) {
   return Math.log10(n);
 }
-function arredondarParaBaixo(n) {
-  return Math.floor(n);
-}
+function arredondarParaBaixo(n) {}
 function arredondarParaCima(n) {
   return Math.ceil(n);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 26. deve arredondar para baixo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/operacoes.js:102:32
 function arredondarParaBaixo(n) {
   return Math.floor(n);
 }
-function arredondarParaCima(n) {
-  return Math.ceil(n);
-}
+function arredondarParaCima(n) {}
 function hipotenusa(catetoA, catetoB) {
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 27. deve arredondar para cima
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined
