[Killed] BlockStatement
src/operacoes.js:105:39
 function arredondarParaCima(n) {
   return Math.ceil(n);
 }
-function hipotenusa(catetoA, catetoB) {
-  return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
-}
+function hipotenusa(catetoA, catetoB) {}
 function grausParaRadianos(graus) {
   return graus * (Math.PI / 180);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 28. deve calcular a hipotenusa de um triângulo retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/operacoes.js:108:35
 function hipotenusa(catetoA, catetoB) {
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
-function grausParaRadianos(graus) {
-  return graus * (Math.PI / 180);
-}
+function grausParaRadianos(graus) {}
 function radianosParaGraus(radianos) {
   return radianos * (180 / Math.PI);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 29. deve converter graus para radianos
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:109:19
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
 function grausParaRadianos(graus) {
-  return graus * (Math.PI / 180);
+  return graus * (Math.PI * 180);
 }
 function radianosParaGraus(radianos) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 29. deve converter graus para radianos
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 3.141592653589793
Received: 101787.6019763093

Expected precision:    2
Expected difference: < 0.005
Received difference:   101784.46038365572

[Killed] ArithmeticOperator
src/operacoes.js:109:10
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
 function grausParaRadianos(graus) {
-  return graus * (Math.PI / 180);
+  return graus / (Math.PI / 180);
 }
 function radianosParaGraus(radianos) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 29. deve converter graus para radianos
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 3.141592653589793
Received: 10313.240312354817

Expected precision:    2
Expected difference: < 0.005
Received difference:   10310.098719701227

[Killed] BlockStatement
src/operacoes.js:111:38
 function grausParaRadianos(graus) {
   return graus * (Math.PI / 180);
 }
-function radianosParaGraus(radianos) {
-  return radianos * (180 / Math.PI);
-}
+function radianosParaGraus(radianos) {}
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 30. deve converter radianos para graus
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:112:22
   return graus * (Math.PI / 180);
 }
 function radianosParaGraus(radianos) {
-  return radianos * (180 / Math.PI);
+  return radianos * (180 * Math.PI);
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 30. deve converter radianos para graus
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 180
Received: 1776.5287921960844

Expected precision:    2
Expected difference: < 0.005
Received difference:   1596.5287921960844

[Killed] ArithmeticOperator
src/operacoes.js:112:10
   return graus * (Math.PI / 180);
 }
 function radianosParaGraus(radianos) {
-  return radianos * (180 / Math.PI);
+  return radianos / (180 / Math.PI);
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 30. deve converter radianos para graus
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 180
Received: 0.05483113556160754

Expected precision:    2
Expected difference: < 0.005
Received difference:   179.9451688644384

[Killed] BlockStatement
src/operacoes.js:116:20
 }
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
-function mdc(a, b) {
-  // Máximo Divisor Comum
-  while (b) {
-    [a, b] = [b, a % b];
-  }
-  return a;
-}
+function mdc(a, b) {}
 function mmc(a, b) {
   // Mínimo Múltiplo Comum
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 31. deve calcular o MDC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:118:10
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) {
   // Máximo Divisor Comum
-  while (b) {
+  while (false) {
     [a, b] = [b, a % b];
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 31. deve calcular o MDC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Timeout] BlockStatement
src/operacoes.js:118:13
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) {
   // Máximo Divisor Comum
-  while (b) {
-    [a, b] = [b, a % b];
-  }
+  while (b) {}
   return a;
 }

[Timeout] ArithmeticOperator
src/operacoes.js:119:18
 function mdc(a, b) {
   // Máximo Divisor Comum
   while (b) {
-    [a, b] = [b, a % b];
+    [a, b] = [b, a * b];
   }
   return a;

[Killed] BlockStatement
src/operacoes.js:123:20
   }
   return a;
 }
-function mmc(a, b) {
-  // Mínimo Múltiplo Comum
-  return (a * b) / mdc(a, b);
-}
+function mmc(a, b) {}
 function isPrimo(n) {
   if (n <= 1) return false;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:125:10
 }
 function mmc(a, b) {
   // Mínimo Múltiplo Comum
-  return (a * b) / mdc(a, b);
+  return a * b * mdc(a, b);
 }
 function isPrimo(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 250

[Killed] ArithmeticOperator
src/operacoes.js:125:11
 }
 function mmc(a, b) {
   // Mínimo Múltiplo Comum
-  return (a * b) / mdc(a, b);
+  return (a / b) / mdc(a, b);
 }
 function isPrimo(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0.4

[Killed] ConditionalExpression
src/operacoes.js:128:7
   return (a * b) / mdc(a, b);
 }
 function isPrimo(n) {
-  if (n <= 1) return false;
+  if (true) return false;
   for (let i = 2; i < n; i++) {
     if (n % i === 0) return false;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/operacoes.js:128:7
   return (a * b) / mdc(a, b);
 }
 function isPrimo(n) {
-  if (n <= 1) return false;
+  if (n < 1) return false;
   for (let i = 2; i < n; i++) {
     if (n % i === 0) return false;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 63. isPrimo - deve retornar false para 0, 1 e não-primos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/operacoes.js:129:19
 }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i < n; i++) {
+  for (let i = 2; false; i++) {
     if (n % i === 0) return false;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 63. isPrimo - deve retornar false para 0, 1 e não-primos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/operacoes.js:130:9
 function isPrimo(n) {
   if (n <= 1) return false;
   for (let i = 2; i < n; i++) {
-    if (n % i === 0) return false;
+    if (n * i === 0) return false;
   }
   return true;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 63. isPrimo - deve retornar false para 0, 1 e não-primos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:130:9
 function isPrimo(n) {
   if (n <= 1) return false;
   for (let i = 2; i < n; i++) {
-    if (n % i === 0) return false;
+    if (n % i !== 0) return false;
   }
   return true;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:134:23
   }
   return true;
 }
-function fibonacci(n) {
-  // Retorna o n-ésimo termo
-  if (n <= 1) return n;
-  return fibonacci(n - 1) + fibonacci(n - 2);
-}
+function fibonacci(n) {}
 function produtoArray(numeros) {
   if (numeros.length === 0) return 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:136:7
 }
 function fibonacci(n) {
   // Retorna o n-ésimo termo
-  if (n <= 1) return n;
+  if (false) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
src/operacoes.js:136:7
 }
 function fibonacci(n) {
   // Retorna o n-ésimo termo
-  if (n <= 1) return n;
+  if (true) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 10

[Killed] ArithmeticOperator
src/operacoes.js:137:39
 function fibonacci(n) {
   // Retorna o n-ésimo termo
   if (n <= 1) return n;
-  return fibonacci(n - 1) + fibonacci(n - 2);
+  return fibonacci(n - 1) + fibonacci(n + 2);
 }
 function produtoArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
src/operacoes.js:148:42
   if (valor > max) return max;
   return valor;
 }
-function isDivisivel(dividendo, divisor) {
-  return dividendo % divisor === 0;
-}
+function isDivisivel(dividendo, divisor) {}
 function celsiusParaFahrenheit(celsius) {
   return (celsius * 9) / 5 + 32;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 37. deve verificar se um número é divisível por outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:149:10
   return valor;
 }
 function isDivisivel(dividendo, divisor) {
-  return dividendo % divisor === 0;
+  return true;
 }
 function celsiusParaFahrenheit(celsius) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 64. isDivisivel - deve retornar false quando não é divisível
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:149:10
   return valor;
 }
 function isDivisivel(dividendo, divisor) {
-  return dividendo % divisor === 0;
+  return dividendo % divisor !== 0;
 }
 function celsiusParaFahrenheit(celsius) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 37. deve verificar se um número é divisível por outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:151:41
 function isDivisivel(dividendo, divisor) {
   return dividendo % divisor === 0;
 }
-function celsiusParaFahrenheit(celsius) {
-  return (celsius * 9) / 5 + 32;
-}
+function celsiusParaFahrenheit(celsius) {}
 function fahrenheitParaCelsius(fahrenheit) {
   return ((fahrenheit - 32) * 5) / 9;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 38. deve converter Celsius para Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 212
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:152:10
   return dividendo % divisor === 0;
 }
 function celsiusParaFahrenheit(celsius) {
-  return (celsius * 9) / 5 + 32;
+  return celsius * 9 / 5 - 32;
 }
 function fahrenheitParaCelsius(fahrenheit) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 38. deve converter Celsius para Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 212
Received: 148

[Killed] ArithmeticOperator
src/operacoes.js:152:11
   return dividendo % divisor === 0;
 }
 function celsiusParaFahrenheit(celsius) {
-  return (celsius * 9) / 5 + 32;
+  return (celsius / 9) / 5 + 32;
 }
 function fahrenheitParaCelsius(fahrenheit) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 38. deve converter Celsius para Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 212
Received: 34.22222222222222

[Killed] BlockStatement
src/operacoes.js:154:44
 function celsiusParaFahrenheit(celsius) {
   return (celsius * 9) / 5 + 32;
 }
-function fahrenheitParaCelsius(fahrenheit) {
-  return ((fahrenheit - 32) * 5) / 9;
-}
+function fahrenheitParaCelsius(fahrenheit) {}
 function inverso(n) {
   if (n === 0) throw new Error("Não é possível inverter o número zero.");
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 39. deve converter Fahrenheit para Celsius
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:155:12
   return (celsius * 9) / 5 + 32;
 }
 function fahrenheitParaCelsius(fahrenheit) {
-  return ((fahrenheit - 32) * 5) / 9;
+  return ((fahrenheit + 32) * 5) / 9;
 }
 function inverso(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 39. deve converter Fahrenheit para Celsius
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 135.55555555555554

[Killed] ArithmeticOperator
src/operacoes.js:155:10
   return (celsius * 9) / 5 + 32;
 }
 function fahrenheitParaCelsius(fahrenheit) {
-  return ((fahrenheit - 32) * 5) / 9;
+  return (fahrenheit - 32) * 5 * 9;
 }
 function inverso(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 39. deve converter Fahrenheit para Celsius
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 8100

[Killed] BlockStatement
src/operacoes.js:157:21
 function fahrenheitParaCelsius(fahrenheit) {
   return ((fahrenheit - 32) * 5) / 9;
 }
-function inverso(n) {
-  if (n === 0) throw new Error("Não é possível inverter o número zero.");
-  return 1 / n;
-}
+function inverso(n) {}
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:158:7
   return ((fahrenheit - 32) * 5) / 9;
 }
 function inverso(n) {
-  if (n === 0) throw new Error("Não é possível inverter o número zero.");
+  if (false) throw new Error("Não é possível inverter o número zero.");
   return 1 / n;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 65. inverso - deve lançar erro para 0
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Não é possível inverter o número zero."

Received function did not throw

[Killed] EqualityOperator
src/operacoes.js:158:7
   return ((fahrenheit - 32) * 5) / 9;
 }
 function inverso(n) {
-  if (n === 0) throw new Error("Não é possível inverter o número zero.");
+  if (n !== 0) throw new Error("Não é possível inverter o número zero.");
   return 1 / n;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: Não é possível inverter o número zero.

[Killed] ArithmeticOperator
src/operacoes.js:159:10
 }
 function inverso(n) {
   if (n === 0) throw new Error("Não é possível inverter o número zero.");
-  return 1 / n;
+  return 1 * n;
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: 4

[Killed] BlockStatement
src/operacoes.js:163:28
 }
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
-function areaCirculo(raio) {
-  return Math.PI * Math.pow(raio, 2);
-}
+function areaCirculo(raio) {}
 function areaRetangulo(base, altura) {
   return base * altura;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 41. deve calcular a área de um círculo
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:164:10
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(raio) {
-  return Math.PI * Math.pow(raio, 2);
+  return Math.PI / Math.pow(raio, 2);
 }
 function areaRetangulo(base, altura) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 41. deve calcular a área de um círculo
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 314.159
Received: 0.031415926535897934

Expected precision:    2
Expected difference: < 0.005
Received difference:   314.1275840734641

[Killed] BlockStatement
src/operacoes.js:166:38
 function areaCirculo(raio) {
   return Math.PI * Math.pow(raio, 2);
 }
-function areaRetangulo(base, altura) {
-  return base * altura;
-}
+function areaRetangulo(base, altura) {}
 function perimetroRetangulo(base, altura) {
   return 2 * (base + altura);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 42. deve calcular a área de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:167:10
   return Math.PI * Math.pow(raio, 2);
 }
 function areaRetangulo(base, altura) {
-  return base * altura;
+  return base / altura;
 }
 function perimetroRetangulo(base, altura) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 42. deve calcular a área de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 1.25

[Killed] BlockStatement
src/operacoes.js:169:43
 function areaRetangulo(base, altura) {
   return base * altura;
 }
-function perimetroRetangulo(base, altura) {
-  return 2 * (base + altura);
-}
+function perimetroRetangulo(base, altura) {}
 function isMaiorQue(a, b) {
   return a > b;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 43. deve calcular o perímetro de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:170:10
   return base * altura;
 }
 function perimetroRetangulo(base, altura) {
-  return 2 * (base + altura);
+  return 2 / (base + altura);
 }
 function isMaiorQue(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 43. deve calcular o perímetro de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 0.2222222222222222

[Killed] ArithmeticOperator
src/operacoes.js:170:15
   return base * altura;
 }
 function perimetroRetangulo(base, altura) {
-  return 2 * (base + altura);
+  return 2 * (base - altura);
 }
 function isMaiorQue(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 43. deve calcular o perímetro de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 2

[Killed] BlockStatement
src/operacoes.js:172:27
 function perimetroRetangulo(base, altura) {
   return 2 * (base + altura);
 }
-function isMaiorQue(a, b) {
-  return a > b;
-}
+function isMaiorQue(a, b) {}
 function isMenorQue(a, b) {
   return a < b;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 44. deve verificar se um número é maior que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:173:10
   return 2 * (base + altura);
 }
 function isMaiorQue(a, b) {
-  return a > b;
+  return false;
 }
 function isMenorQue(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 44. deve verificar se um número é maior que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/operacoes.js:173:10
   return 2 * (base + altura);
 }
 function isMaiorQue(a, b) {
-  return a > b;
+  return a >= b;
 }
 function isMenorQue(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 51. isMaiorQue - deve matar o mutante de igualdade (>=)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/operacoes.js:175:27
 function isMaiorQue(a, b) {
   return a > b;
 }
-function isMenorQue(a, b) {
-  return a < b;
-}
+function isMenorQue(a, b) {}
 function isEqual(a, b) {
   return a === b;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 45. deve verificar se um número é menor que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:176:10
   return a > b;
 }
 function isMenorQue(a, b) {
-  return a < b;
+  return a <= b;
 }
 function isEqual(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 67. isMenorQue - deve matar o mutante de igualdade (<=)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/operacoes.js:176:10
   return a > b;
 }
 function isMenorQue(a, b) {
-  return a < b;
+  return false;
 }
 function isEqual(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 45. deve verificar se um número é menor que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:178:24
 function isMenorQue(a, b) {
   return a < b;
 }
-function isEqual(a, b) {
-  return a === b;
-}
+function isEqual(a, b) {}
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error("Array vazio не possui mediana.");
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 46. deve verificar se dois números são iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:179:10
   return a < b;
 }
 function isEqual(a, b) {
-  return a === b;
+  return a !== b;
 }
 function medianaArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 46. deve verificar se dois números são iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:179:10
   return a < b;
 }
 function isEqual(a, b) {
-  return a === b;
+  return false;
 }
 function medianaArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 46. deve verificar se dois números são iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:181:32
 function isEqual(a, b) {
   return a === b;
 }
-function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error("Array vazio не possui mediana.");
-  const sorted = [...numeros].sort((a, b) => a - b);
-  const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
-    return (sorted[mid - 1] + sorted[mid]) / 2;
-  }
-  return sorted[mid];
-}
+function medianaArray(numeros) {}
 function dobro(n) {
   return n * 2;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:182:7
   return a === b;
 }
 function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error("Array vazio не possui mediana.");
+  if (false) throw new Error("Array vazio не possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 53 medianaArray - deve lançar erro para array vazio
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio не possui mediana."

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:182:7
   return a === b;
 }
 function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error("Array vazio не possui mediana.");
+  if (true) throw new Error("Array vazio не possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: Array vazio не possui mediana.

[Killed] MethodExpression
src/operacoes.js:183:18
 }
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error("Array vazio не possui mediana.");
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros];
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 74. medianaArray - deve funcionar com array não ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArithmeticOperator
src/operacoes.js:183:46
 }
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error("Array vazio не possui mediana.");
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros].sort((a, b) => a + b);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 74. medianaArray - deve funcionar com array não ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] BlockStatement
src/operacoes.js:185:32
   if (numeros.length === 0) throw new Error("Array vazio не possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
-    return (sorted[mid - 1] + sorted[mid]) / 2;
-  }
+  if (sorted.length % 2 === 0) {}
   return sorted[mid];
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 69. medianaArray - deve calcular a mediana de um array par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 3

[Killed] ConditionalExpression
src/operacoes.js:185:7
   if (numeros.length === 0) throw new Error("Array vazio не possui mediana.");
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
+  if (false) {
     return (sorted[mid - 1] + sorted[mid]) / 2;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 69. medianaArray - deve calcular a mediana de um array par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 3

[Killed] BlockStatement
src/operacoes.js:190:19
   }
   return sorted[mid];
 }
-function dobro(n) {
-  return n * 2;
-}
+function dobro(n) {}
 function triplo(n) {
   return n * 3;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 48. deve calcular o dobro de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:191:10
   return sorted[mid];
 }
 function dobro(n) {
-  return n * 2;
+  return n / 2;
 }
 function triplo(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 48. deve calcular o dobro de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 5

[Killed] BlockStatement
src/operacoes.js:193:20
 function dobro(n) {
   return n * 2;
 }
-function triplo(n) {
-  return n * 3;
-}
+function triplo(n) {}
 function metade(n) {
   return n / 2;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 49. deve calcular o triplo de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:194:10
   return n * 2;
 }
 function triplo(n) {
-  return n * 3;
+  return n / 3;
 }
 function metade(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 49. deve calcular o triplo de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 3.3333333333333335
