[Killed] BlockStatement
src/operacoes.js:196:20
 function triplo(n) {
   return n * 3;
 }
-function metade(n) {
-  return n / 2;
-}
+function metade(n) {}
 
 // Exportando todas as 50 funções
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 50. deve calcular a metade de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:197:10
   return n * 3;
 }
 function metade(n) {
-  return n / 2;
+  return n * 2;
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 50. deve calcular a metade de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 40
